


const syrianLocations = [
  // محافظة حلب
  { name: "حلب", region: "منطقة جبل سمعان" },
  { name: "حلب", region: "منطقة الباب" },
  { name: "حلب", region: "منطقة عفرين" },
  { name: "حلب", region: "منطقة أعزاز" },
  { name: "حلب", region: "منطقة منبج" },
  { name: "حلب", region: "منطقة عين العرب" },
  { name: "حلب", region: "منطقة السفيرة" },
  { name: "حلب", region: "منطقة جرابلس" },
  { name: "حلب", region: "منطقة الأتارب" },
  { name: "حلب", region: "منطقة دير حافر" },
  
  // محافظة دمشق
  { name: "دمشق", region: "دمشق" },
  { name: "دمشق", region: "الميدان" },
  { name: "دمشق", region: "القدم" },
  { name: "دمشق", region: "القصاع" },
  { name: "دمشق", region: "المزة" },
  { name: "دمشق", region: "كفر سوسة" },
  
  // محافظة ريف دمشق
  { name: "ريف دمشق", region: "منطقة دوما" },
  { name: "ريف دمشق", region: "منطقة ريف دمشق" },
  { name: "ريف دمشق", region: "منطقة داريا" },
  { name: "ريف دمشق", region: "منطقة التل" },
  { name: "ريف دمشق", region: "منطقة يبرود" },
  { name: "ريف دمشق", region: "منطقة الزبداني" },
  { name: "ريف دمشق", region: "منطقة النبك" },
  { name: "ريف دمشق", region: "منطقة قدسيا" },
  { name: "ريف دمشق", region: "منطقة القطيفة" },
  { name: "ريف دمشق", region: "منطقة قطنا" },
  
  // محافظة حمص
  { name: "حمص", region: "منطقة حمص" },
  { name: "حمص", region: "منطقة الرستن" },
  { name: "حمص", region: "منطقة تدمر" },
  { name: "حمص", region: "منطقة المخرم" },
  { name: "حمص", region: "منطقة القصير" },
  { name: "حمص", region: "منطقة تلكلخ" },
  
  // محافظة حماة
  { name: "حماه", region: "منطقة حماة" },
  { name: "حماه", region: "منطقة مصياف" },
  { name: "حماه", region: "منطقة السقيلبية" },
  { name: "حماه", region: "منطقة محردة" },
  { name: "حماه", region: "منطقة سلمية" },
  
  // محافظة اللاذقية
  { name: "اللاذقية", region: "منطقة اللاذقية" },
  { name: "اللاذقية", region: "منطقة جبلة" },
  { name: "اللاذقية", region: "منطقة القرداحة" },
  { name: "اللاذقية", region: "منطقة الحفة" },
  { name: "اللاذقية", region: "منطقة صلنفة" },
  
  // محافظة طرطوس
  { name: "طرطوس", region: "منطقة طرطوس" },
  { name: "طرطوس", region: "منطقة بانياس" },
  { name: "طرطوس", region: "منطقة الشيخ بدور" },
  { name: "طرطوس", region: "منطقة دريكيش" },
  { name: "طرطوس", region: "منطقة صافيتا" },
  
  // محافظة إدلب
  { name: "ادلب", region: "منطقة إدلب" },
  { name: "ادلب", region: "منطقة أريحا" },
  { name: "ادلب", region: "منطقة معرة النعمان" },
  { name: "ادلب", region: "منطقة حارم" },
  { name: "ادلب", region: "منطقة جسر الشغور" },
  
  // محافظة الحسكة
  { name: "الحسكة", region: "منطقة الحسكة" },
  { name: "الحسكة", region: "منطقة القامشلي" },
  { name: "الحسكة", region: "منطقة المالكية" },
  { name: "الحسكة", region: "منطقة رأس العين" },
  { name: "الحسكة", region: "منطقة عامودا" },
  
  // محافظة دير الزور
  { name: "دير الزور", region: "منطقة دير الزور" },
  { name: "دير الزور", region: "منطقة الميادين" },
  { name: "دير الزور", region: "منطقة البوكمال" },

  
  // محافظة الرقة
  { name: "الرقة", region: "منطقة الرقة" },
  { name: "الرقة", region: "منطقة الثورة" },
  { name: "الرقة", region: "منطقة تل أبيض" },
  
  // محافظة السويداء
  { name: "السويداء", region: "منطقة السويداء" },
  { name: "السويداء", region: "منطقة صلخد" },
  { name: "السويداء", region: "منطقة شهبا" },
 
  
  // محافظة درعا
  { name: "درعا", region: "منطقة درعا" },
  { name: "درعا", region: "منطقة ازرع" },
  { name: "درعا", region: "منطقة الصنمين" },
  { name: "درعا", region: "منطقة داعل" },
  { name: "درعا", region: "منطقة الشيخ مسكين" },
  
  // محافظة القنيطرة
  { name: "القنيطرة", region: "منطقة القنيطرة" },
  { name: "القنيطرة", region: "منطقة فيق" },

];